phmarek/ESP32-BLE-Gamepad/BleGamepad.cpp
	if (includeGyro) {
	
		// USAGE_PAGE (Sensor)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x20;

		// COLLECTION (Physical)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0xA1;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

		// USAGE (Gyro 3d)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x76;
                
		// USAGE (Accel 3d)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x73;

		// END_COLLECTION (Physical)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0xc0;
        }
		
	// END_COLLECTION (Application)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xc0;
	
  xTaskCreate(this->taskServer, "server", 20000, (void *)this, 5, NULL);
}

void BleGamepad::end(void)
{
}

void BleGamepad::setGyro(int16_t gx, int16_t gy, int16_t gz, int16_t ax, int16_t ay, int16_t az)
{
    _gX = gx;
    _gY = gy;
    _gZ = gz;
    _aX = ax;
    _aY = ay;
    _aZ = az;
}

void BleGamepad::setAxes(int16_t x, int16_t y, int16_t z, int16_t rZ, int16_t rX, int16_t rY, signed char hat1, signed char hat2, signed char hat3, signed char hat4)
{
	if(x == -32768) { x = -32767; }
	if(y == -32768) { y = -32767; }
	if(z == -32768) { z = -32767; }
	if(rZ == -32768) { rZ = -32767; }
	if(rX == -32768) { rX = -32767; }
	if(rY == -32768) { rY = -32767; }

	_x = x;
	_y = y;
	_z = z;
	_rZ = rZ;
	_rX = rX;
	_rY = rY;
	_hat1 = hat1;
	_hat2 = hat2;
	_hat3 = hat3;
	_hat4 = hat4;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setSimulationControls(int16_t rudder, int16_t throttle, int16_t accelerator, int16_t brake, int16_t steering)
{
  if(rudder == -32768) { rudder = -32767; }
  if(throttle == -32768) { throttle = -32767; }
  if(accelerator == -32768) { accelerator = -32767; }
  if(brake == -32768) { brake = -32767; }
  if(steering == -32768) { steering = -32767; }
  
  _rudder = rudder;
  _throttle = throttle;
  _accelerator = accelerator;
  _brake = brake;
  _steering = steering;
	
  if(_autoReport){ sendReport(); }
}

void BleGamepad::setHats(signed char hat1, signed char hat2, signed char hat3, signed char hat4)
{
	_hat1 = hat1;
	_hat2 = hat2;
	_hat3 = hat3;
	_hat4 = hat4;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::sendReport(void)
{
	if (this->isConnected())
	{
		uint8_t currentReportIndex = 0;
		
		uint8_t m[reportSize];
		uint8_t i;
		
		memset(&m,0,sizeof(m));
		memcpy(&m, &_buttons, sizeof(_buttons));
		
		currentReportIndex+=numOfButtonBytes;
		
 		if(_includeXAxis){ m[currentReportIndex++] = _x;	m[currentReportIndex++] = (_x >> 8); }
		if(_includeYAxis){ m[currentReportIndex++] = _y;	m[currentReportIndex++] = (_y >> 8); }
		if(_includeZAxis){ m[currentReportIndex++] = _z;	m[currentReportIndex++] = (_z >> 8); }
		if(_includeRzAxis){ m[currentReportIndex++] = _rZ; 	m[currentReportIndex++] = (_rZ >> 8); }
		if(_includeRxAxis){ m[currentReportIndex++] = _rX; 	m[currentReportIndex++] = (_rX >> 8); }
		if(_includeRyAxis){ m[currentReportIndex++] = _rY; 	m[currentReportIndex++] = (_rY >> 8); }
		
		for(i=0; i< _sliderCount; i++) {
			m[currentReportIndex++] = _sliders[i];
			m[currentReportIndex++] = (_sliders[i] >> 8);
		}
  
		if(_includeRudder){ m[currentReportIndex++] = _rudder;	m[currentReportIndex++] = (_rudder >> 8); }
		if(_includeThrottle){ m[currentReportIndex++] = _throttle;	m[currentReportIndex++] = (_throttle >> 8); }
		if(_includeAccelerator){ m[currentReportIndex++] = _accelerator;	m[currentReportIndex++] = (_accelerator >> 8); }
		if(_includeBrake){ m[currentReportIndex++] = _brake; 	m[currentReportIndex++] = (_brake >> 8); }
		if(_includeSteering){ m[currentReportIndex++] = _steering; 	m[currentReportIndex++] = (_steering >> 8); }
		
		if(_hatSwitchCount > 0)
		{
			signed char hats[4];
			
			hats[0] = _hat1;
			hats[1] = _hat2;
			hats[2] = _hat3;
			hats[3] = _hat4;
	        	
			for(int currentHatIndex = _hatSwitchCount -1 ; currentHatIndex >= 0 ; currentHatIndex--)
			{
				m[currentReportIndex++] = hats[currentHatIndex];
			}
		}

                if (_includeGyro) {
                    m[currentReportIndex++] = _gX;	m[currentReportIndex++] = (_gX >> 8);
                    m[currentReportIndex++] = _gY;	m[currentReportIndex++] = (_gY >> 8);
                    m[currentReportIndex++] = _gZ;	m[currentReportIndex++] = (_gZ >> 8);
                    m[currentReportIndex++] = _aX; 	m[currentReportIndex++] = (_aX >> 8);
                    m[currentReportIndex++] = _aY; 	m[currentReportIndex++] = (_aY >> 8);
                    m[currentReportIndex++] = _aZ; 	m[currentReportIndex++] = (_aZ >> 8);
                }
		
		this->inputGamepad->setValue(m, sizeof(m));
		this->inputGamepad->notify();
	}
}

void BleGamepad::press(uint8_t b)
{

  uint8_t index = (b-1) / 8;
  uint8_t bit = (b-1) % 8;
  uint8_t bitmask = (1 << bit);

  uint8_t result = _buttons[index] | bitmask;
  
  if (result != _buttons[index]) 
  {
    _buttons[index] = result;
  }
  
  if(_autoReport){ sendReport(); }
}

void BleGamepad::release(uint8_t b)
{
  uint8_t index = (b-1) / 8;
  uint8_t bit = (b-1) % 8;
  uint8_t bitmask = (1 << bit);

  uint64_t result = _buttons[index] & ~bitmask;
  
  if (result != _buttons[index]) 
  {
    _buttons[index] = result;
  }
  
  if(_autoReport){ sendReport(); }

}

void BleGamepad::setLeftThumb(int16_t x, int16_t y)
{
	if(x == -32768) { x = -32767; }
	if(y == -32768) { y = -32767; }
	
	_x = x;
	_y = y;
	
	if(_autoReport){ sendReport(); }
}
void BleGamepad::setRightThumb(int16_t z, int16_t rZ)
{
	if(z == -32768) { z = -32767; }
	if(rZ == -32768) { rZ = -32767; }
	
	_z = z;
	_rZ = rZ;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setLeftTrigger(int16_t rX)
{
	if(rX == -32768) {rX = -32767; }
	
	_rX = rX;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setRightTrigger(int16_t rY)
{
	if(rY == -32768) {rY = -32767; }
	
